{
  "Builderz": "بيلدرز",
  "Home": "الرئيسية",
  "Ready to be one of BUILDERZ?!": "هل انت جاهز للبناء؟",
  "Build a better world need to a man, build a man needs a huge effort": "بناء عالم أفضل يحتاج انسانا صالحا، وبناء انسانا صالحا يحتاج الكثير.",
  "Register Now": "سجل الآن",
  "Teach With Us": "علّم معنا",
  "About BuilderZ": "عن بيلدرز",
  "The most important mission we should accomplish to make the world a better place is building our kid's characters to set their minds through learning them human core values and principles that should lead them always to make the right decisions about the life's paths, it will take a huge effort and corporation work between three sectors \" the parents, teachers and the creative learning methods and tools that fit for each kid representing in BuilderZ.": "عد بناء شخصية الطفل و تأسيس القيم والمباديء بداخله لينشأ بفكر سليم من أهم المهام التي ينبغي أن نخوضها من أجل عالم أفضل. إن تأهيل طفل لديه القدرة على أن يواجه التحديات المستقبلية، ويتخذ القرارات الصحيحة فيما يتعلق بمساراته في الحياة على جميع نواحيها العلمية والاجتماعية والمهنية يتطلب جهدا مبذولا، وعمل تعاوني مشترك بين الوالدين، والمعلم، والطرق الإبداعية ووسائل التعليم المختلفة التي تناسب شخصية كل طفل",
  "So, we are here to contribute as experts and thought leaders in the educational field and raising kids to destinate this efforts correctly with found a platform include everything is needed by:": "كان لابد من مساهمتنا كخبراء ومتخصصين في مجال التعليم والتنشئة التربوية للأطفال لتوجيه هذه الجهود بشكل سليم عن طريق عمل منصة تضم ما يحتاجه كل من",
  "kids, to qualify in all personal, social,scientific skills.": "الطفل، ليتأهل في جميع المهارات الشخصية والاجتماعية والنفسية والعلمية",
  "Parents, to help them in preparing their kids well.": "الوالدان، ليساعدهم على تأهيل الأطفال بشكل صحي وسليم",
  "Teachers, to complete the missing line in the balance raising triangle for kids, though influence them positively by using multi educational tools.": "المعلم، ليكمل الضلع الناقص في مثلث التنشئة المعتدلة للطفل، عن طريق التأثير عليه بشكل إيجابي باستخدام الوسائل التعليمية المختلفة.",
  "Read More": "اقرأ المزيد",
  "Why BuilderZ?": "لماذا بيلدرز؟",
  "Comprehensive assessments to discover the kids’ talents and improve them": "اختبارات متكاملة لاكتشاف مهارات الأولاد والعمل على تنميتها",
  "Character building is defined as realizing the abilities and tendencies of each kid. So, we carry on a talent assessment process in order to be able to give a hand and direct... the kids to whatever fits their character. By doing that, we open up a great space for the kids in which they can grow themselves, and grow creative.": "من منطلق بناء الشخصية هي معرفة القدرات والميول لدى كل طفل، لذلك نظمنا اختبارات متكاملة لتحقيق ذلك. حتى نتمكن من توجيه الأطفال لما يناسب شخصياتهم ليستطيعوا الإبداع به",
  "Hello": "Hello",
  "Raising Integrated Solution for Kids, Parents and Teachers": "حلول كاملة للتربية تساعد الأولاد والأبوين والمعلمين",
  "ADV_2": "لن نكتفي فقط با الاهتمام بالأطفال، فبناء الطفل يبدأ من دوائر الأمان لديه وهم الآباء والمدرسين، لذلك نقدم حلول تربوية للجميع، تلبي جميع الاحتياجات من تعليم واستشارات وخبراء ومتخصصين بالإضافة إلى محتوى متميز يقدم من خلال منصتنا.",
  "Creative Education Methodologies Usine Different Methods In Teaching": "طرق ابداعية ومتنوعة في التواصل مع الأولاد وغرز القيم بداخلهم وبناء شخصياتهم",
  "such as simulating, effective communication and experiments helping kids to be creative as well as becoming adults can decide their own career paths that make the world a better place.": "إن استخدام سبل تعليمية مختلفة مثل المحاكاة والتواصل الفعال و التجربة يساعد الطفل على الإبداع و ينمي مهارات التقدم ليصبح شخصا بالغاََ قادراََ على اختيار المسار المهني المناسب لشخصيته وقدراته والذي يستطيع من خلاله أن يُحدث تغييرا في العالم.",
  "Share With": "مشاركة"
}